In [1]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
    "Name" : ["Harry", "Ramesh", "Rohit", "Shubh"],
    "Marks" : [90, 88, 79, 95],
    "City" : ["Rampur", "Pune", "Mumbai", "Delhi"]
}

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

     Name  Marks    City
0   Harry     90  Rampur
1  Ramesh     88    Pune
2   Rohit     79  Mumbai
3   Shubh     95   Delhi

In [9]:
df.to_csv("friends.csv")

In [12]:
df.to_csv("friends.csv", index=False)

In [13]:
df.head(2)

     Name  Marks    City
0   Harry     90  Rampur
1  Ramesh     88    Pune

In [14]:
df.tail(2)

    Name  Marks    City
2  Rohit     79  Mumbai
3  Shubh     95   Delhi

In [16]:
df.describe()

           Marks
count   4.000000
mean   88.000000
std     6.683313
min    79.000000
25%    85.750000
50%    89.000000
75%    91.250000
max    95.000000

In [17]:
df['Marks']

0    90
1    88
2    79
3    95
Name: Marks, dtype: int64

In [19]:
df['Marks'][1]

88

In [21]:
df['Marks'][1] = 91

C:\Users\Admin\AppData\Local\Temp\ipykernel_2904\2633012401.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Marks'][1] = 91

In [22]:
df

     Name  Marks    City
0   Harry     90  Rampur
1  Ramesh     91    Pune
2   Rohit     79  Mumbai
3   Shubh     95   Delhi

In [ ]:
df.index = ["first", "second", "third", "fourth"]